In [1]:
''' PANDAS libraey
'''

' PANDAS libraey\n'

In [ ]:
import pandas as pd

In [5]:
a = pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
''' data frame '''
a = {
    "Emp_id" : [1,2,3,4,5,6,7,8],
    "Name" : ['sam','lakshit','devesh','ayush','lolo','neeraj','abhinav','shakti'],
    "department" : ['it','hr','sales','it','hr','hr','hr','sales'],
    "salary" : [25000,35000,44000,60000,34000,50000,40000,55000],
    "working_hour" : [8,9,8,9,8,9,8,9]
    }

In [10]:
df=pd.DataFrame(a)
df

   Emp_id     Name department  salary  working_hour
0       1      sam         it   25000             8
1       2  lakshit         hr   35000             9
2       3   devesh      sales   44000             8
3       4    ayush         it   60000             9
4       5     lolo         hr   34000             8
5       6   neeraj         hr   50000             9
6       7  abhinav         hr   40000             8
7       8   shakti      sales   55000             9

In [11]:
''' HOW TO CHECK TOP 5 DATA FROM A DATAFRAME
'''

' HOW TO CHECK TOP 5 DATA FROM A DATAFRAME\n'

In [12]:
df.head()

   Emp_id     Name department  salary  working_hour
0       1      sam         it   25000             8
1       2  lakshit         hr   35000             9
2       3   devesh      sales   44000             8
3       4    ayush         it   60000             9
4       5     lolo         hr   34000             8

In [19]:
df.head(2)

   Emp_id     Name department  salary  working_hour
0       1      sam         it   25000             8
1       2  lakshit         hr   35000             9

In [20]:
''' HOW TO CHECK BOTTOM DATA
'''

' HOW TO CHECK BOTTOM DATA\n'

In [17]:
df.tail()

   Emp_id     Name department  salary  working_hour
3       4    ayush         it   60000             9
4       5     lolo         hr   34000             8
5       6   neeraj         hr   50000             9
6       7  abhinav         hr   40000             8
7       8   shakti      sales   55000             9

In [18]:
df.tail(2)

   Emp_id     Name department  salary  working_hour
6       7  abhinav         hr   40000             8
7       8   shakti      sales   55000             9

In [21]:
''' HOW TO CHECK RANDOM INDEXED DATA 
'''

' HOW TO CHECK RANDOM INDEXED DATA \n'

In [22]:
df.sample(3)

   Emp_id    Name department  salary  working_hour
2       3  devesh      sales   44000             8
3       4   ayush         it   60000             9
4       5    lolo         hr   34000             8

In [ ]:
''' HOW TO EXPORT OUR DATA
'''

In [23]:
df.to_csv("C:\\Users\\laksh\\Desktop\\atg\\emp__info.csv")